/* eslint-disable no-irregular-whitespace */
<template>
  <div>
    <v-container class="grey lighten-5">
      <div class="main">
        <div class="medium">
          <v-alert
          v-on:click.native = "showInfo('obminiuvannia')"
          :elevation="5"
          class="medium"
          type="info"
          border="left"
          >
            Обмінювання інформацією та консультування 
          </v-alert>
        </div>
        <div class="subDiv">
          <div class="small">
            <v-alert
            v-on:click.native = "showInfo('vstanovlennia')"
            :elevation="5"
            type="info"
            border="top"
            >
            Установлення оточення
          </v-alert>
          </div>
          <div class="small">
            <v-alert
            v-on:click.native = "showInfo('zagalneOciniuvannia')"
            :elevation="5"
            type="info">
            Загальне оцінювання ризику
          </v-alert>
          </div>
          <div class="small">
            <v-alert
            v-on:click.native = "showInfo('identufikuvannia')"
            :elevation="5"
            type="info">
            Ідентифікування ризику
          </v-alert>
          </div>
          <div class="small">
            <v-alert
            v-on:click.native = "showInfo('analizuvannia')"
            :elevation="5"
            type="info">
            Аналізування ризику
          </v-alert>
          </div>
          <div class="small">
            <v-alert
            v-on:click.native = "showInfo('ocinuivannia')"
            :elevation="5"
            type="info">
            Оцінювання ризику
          </v-alert></div>
          <div class="small">
            <v-alert
            v-on:click.native = "showInfo('obroblennia')"
            :elevation="5"
            type="info"
            border="bottom"
            >
            Обробляння ризику
          </v-alert>
          </div>
        </div>
        <div class="medium">
          <v-alert
          v-on:click.native = "showInfo('monitorynh')"
          :elevation="5"
          class="medium"
          type="info"
          border="right"
          >
            Моніторинг і критичне аналізування
          </v-alert>
        </div>
      </div>
    </v-container>
    <v-card 
    v-show="vShow.obminiuvannia"
    >
      <v-card-title>
        Обмінювання інформацією та консультування
      </v-card-title>
      <v-card-text>
        <p>Успішність загального оцінювання ризику залежить від результативності обмінювання інформацією та консультування з зацікавленими сторонами.
Залучення зацікавлених сторін до процесу керування ризиком необхідне, щоб <p>
  <ul>
    <li>— розробляти план обмінювання інформацією;</li>
    <li>— належно визначати оточення;</li>
    <li>— забезпечувати розуміння та враховування інтересів зацікавлених сторін;</li>
    <li>— об’єднувати різні напрями фахової компетентності для ідентифікування та аналізування ризику;</li>
    <li>— забезпечувати належне враховування різних поглядів під час оцінювання ризиків;</li>
    <li>— забезпечувати адекватне ідентифікування ризиків;</li>
    <li>— гарантувати ухвалення та підтримання плану обробляння.</li>
  </ul>
<p>Зацікавлені сторони треба залучати до забезпечення взаємного зв’язку між процесом загального оцінювання ризику та іншими напрямами керування, зокрема керування змінами, керування проектами та програмами, а також керування фінансами.
</p>
      </v-card-text>
    </v-card>
    <v-card
    v-show="vShow.vstanovlennia"
    >
      <v-card-title>
        Установлення оточення
      </v-card-title>
      <v-card-text>
        <p>Установлення оточення дає змогу визначити основні параметри керування ризиком і сферу застосування та критерії для іншої частини процесу. Установлення оточення передбачає враховування внутрішніх і зовнішніх параметрів, пов’язаних з організацією загалом, а також попереднього досвіду стосовно конкретних ризиків, що їх охоплюють загальним оцінюванням.
          Під час установлювання оточення визначають і погоджують цілі загального оцінювання ризику, критерії ризику та програму загального оцінювання ризику.
          У разі загального оцінювання конкретного ризику треба, щоб установлення оточення охоплювало визначання зовнішнього, внутрішнього оточення, а також оточення керування ризиком і класифікуван¬ня критеріїв ризику:</p>
          <ul>
          <li>a) установлення зовнішнього оточення передбачає ознайомлення з середовищем, у якому функціюють організація та система, а саме:</li>
          <li>— культурні, політичні, правові, регуляторні, фінансові, економічні та конкурентні чинники середо¬вища на міжнародному, національному, регіональному чи місцевому рівнях;</li>
          <li>— ключові чинники та тенденції, що впливають на цілі організації;</li>
          <li>— сприйняття та цінності зовнішніх зацікавлених сторін;</li>
          <li>b) установлення внутрішнього оточення передбачає з’ясування</li>
          <li>— можливостей організації стосовно ресурсів і знань;</li>
          <li>— інформаційних потоків і процесів прийняття рішень;</li>
          <li>— внутрішніх зацікавлених сторін;</li>
          <li>— цілей, а також запроваджених стратегій їх досягання;</li>
          <li></li>
          <li>— політик і процесів;</li>
          <li>— стандартів і базових моделей, прийнятих організацією;</li>
          <li>— структур (наприклад, підпорядкування, ролей і підзвітності);</li>
          <li>c) установлення оточення процесу керування ризиком передбачає</li>
          <li>— визначення підзвітності та відповідальності;</li>
          <li>— визначення обсягу діяльності з керування ризиком, який треба виконати, зокрема спеціальні долучення та винятки;</li>  
          <li>— визначення обсягу проекту, процесу, функції чи діяльності стосовно тривалості та місця про-вадження;</li>
          <li>— визначення взаємозв’язків між конкретним проектом або конкретною діяльністю та іншими проектами чи видами діяльності організації;</li>
          <li>— визначення методологій загального оцінювання ризику;</li>
          <li>— визначення критеріїв ризику;</li>
          <li>— визначення способів оцінювання дієвості керування ризиком;</li>
          <li>— визначення та конкретизацію рішень, які треба прийняти, і дій, які треба виконати;</li>
          <li>— ідентифікацію необхідних досліджень з установлення сфери чи меж застосування, їхніх об¬сягу, цілей, а також ресурсів, потрібних для цих досліджень;</li>
          <li>d) визначення критеріїв ризику передбачає прийняття рішень щодо</li>
          <li>— характеру й типів можливих наслідків і способу їх вимірювання;</li>
          <li>— способу подавання ймовірностей;</li>
          <li>— способу визначання рівня ризику;</li>
          <li>— критеріїв, за якими прийматимуть рішення щодо необхідності обробляння ризику;</li>
          <li>— критеріїв, за якими прийматимуть рішення щодо прийнятності та/чи допустимості ризику;</li>
          <li>— того, чи враховуватимуть комбінації ризиків, і в який спосіб це робитимуть.</li>
          <li>Основою критеріїв можуть бути такі джерела:</li>
          <li>— узгоджені цілі процесу;</li>
          <li>— критерії, ідентифіковані у специфікаціях;</li>
          <li>— загальні джерела даних;</li>
          <li>— загальноприйняті у промисловості критерії, наприклад, рівні повноти безпеки;</li>
          <li>— готовність організації до ризику;</li>
          <li>— правові та інші вимоги до конкретного устатковання чи конкретних випадків застосування.</li>
          </ul>
      </v-card-text>
    </v-card>
    <v-card
    v-show="vShow.zagalneOciniuvannia"
    >
      <v-card-title>
        Загальне оцінювання ризику
      </v-card-title>
      <v-card-text>
        <p>Загальне оцінювання ризику — це спільний процес ідентифікування ризику, аналізування ризику та оцінювання ризику.
        Загальне оцінювання ризику можна провадити на рівні організації, на рівні підрозділів, стосовно проектів, окремих видів діяльності або конкретних ризиків. Різним оточенням можуть відповідати різні засоби та методики.
        Загальне оцінювання ризику забезпечує розуміння ризиків, їхніх причин, наслідків і їхніх імовірностей. Воно зазначає вхідні дані для прийняття рішень щодо</p>
        <ul>
        <li>— необхідності розпочинати певну діяльність;</li>
        <li>— способів максимізування можливостей;</li>
        <li>— потреби обробляти ризики;</li>
        <li>— вибирання серед варіантів з різними ризиками;</li>
        <li>— установлення пріоритетності варіантів обробляння ризику;</li>
        <li>— вибору найбільш відповідних стратегій обробляння ризиків, які зменшуватимуть несприятливі ризики до допустимого рівня.</li>
       </ul>    
      </v-card-text>
    </v-card>
    <v-card
    v-show="vShow.identufikuvannia"
    >
      <v-card-title>
        Ідентифікування ризику
      </v-card-title>
      <v-card-text>
        <p>Ідентифікування ризику — це процес виявляння, усвідомлення та реєстрування ризиків.
        Призначеність ідентифікування ризику — визначити, що може статися, або які можуть виникнути ситуації, що можуть впливати на досягнення цілей системи чи організації. Після того, як ризик ідентифіковано, організація має визначити будь-які наявні засоби контролювання, зокрема стосовно конструктивних особливостей, персоналу, процесів і систем.
        Процес ідентифікування ризику охоплює визначення причин і джерела ризику (небезпеки в контексті фізичної шкоди), подій, ситуацій або обставин, які можуть чинити матеріальний вплив на досягнення цілей, а також визначення характеру цього впливу.
        Методами ідентифікування ризику можуть бути:</p>
        <ul>
          <li>— доказові методи, наприклад, застосування переліків контрольних запитань і критичне аналізування хронологічних даних;</li>
          <li>— системні методи групової роботи, коли група експертів систематично ідентифікує ризики за допомогою ст'руктурованого набору навідних фраз або запитань;</li>
          <li>— методи індуктивного мислення, наприклад, НАZ0Р.</li>
        </ul>
        <p>
        Щоб поліпшити точність і повноту ідентифікування ризику, можна використовувати різноманітні допоміжні методи, зокрема «мозкову атаку» та метод Дельфі.
        Незалежно від фактично застосованих методів під час ідентифікування ризику особливу увагу важ¬ливо приділяти людським та організаційним чинникам. Тому під час процесу ідентифікування ризику треба враховувати відхили людських і організаційних чинників від очікуваних станів, а також події, по¬в’язані з технічними та програмними засобами.
        </p>
        </v-card-text>
    </v-card>
    <v-card
    v-show="vShow.analizuvannia"
    >
      <v-card-title>
        Аналізування ризику
      </v-card-title>
      <v-card-subtitle>
        Загальні положення
      </v-card-subtitle>
      <v-card-text>
        <p>Ризик аналізують для того, щоб поглибити розуміння ризику. Воно дає змогу отримувати вхідні дані для загального оцінювання ризику і прийняття рішень щодо потреби оброблення ризику та щодо найбільш відповідних стратегій і методів обробляння.
Аналізування ризику полягає у визначанні наслідків і їхніх імовірностей стосовно ідентифікова¬них ризикових подій, ураховуючи наявність (чи відсутність) і результативність будь-яких наявних за¬собів контролювання. Потім наслідки та їхні ймовірності поєднують, щоб визначити рівень ризику.
Аналізування ризику передбачає розглядання причин і джерел ризику, їхніх наслідків та ймовірностей виникнення цих наслідків. Треба визначити чинники, що впливають на наслідки і ймовірність. Подія може мати багато наслідків і може впливати на багато цілей. Треба враховувати наявні засоби контролювання та їхню результативність. Різноманітні методи цього аналізування описано в додатку В. У складних випадках може бути потрібно застосувати кілька методів.
Аналізування ризику, зазвичай, передбачає кількісне оцінювання низки потенційних наслідків, які можуть виникати за настання події, ситуації чи обставини, а також пов’язаних з ними ймовірностей з тим, щоб виміряти рівень ризику. Однак, у деяких випадках, наприклад, коли наслідки незначні чи коли очікувана ймовірність надзвичайно низька, для прийняття рішення може бути достатньо оцінки лише одного параметра.
За деяких обставин наслідок може бути результатом низки різних подій чи умов або того, що конк¬ретну подію не ідентифіковано. У такому разі загальне оцінювання ризику зосереджують на аналізу¬ванні важливості та вразливості елементів системи з тим, щоб визначити види обробляння ризику, по¬в’язані з рівнями захисту чи стратегіями відновлювання.
Методи, використовувані під час аналізування ризику, можуть бути якісними, напівкількісними чи кількісними. Необхідний ступінь докладності залежить від конкретного випадку застосування, наявності вірогідних даних і потреб організації щодо прийняття рішень. Деякі методи та ступінь докладності аналізування може бути приписано в законодавстві.
Якісне загальне оцінювання дає змогу позначити наслідок, імовірність і рівень ризику такими термінами щодо рівня значущості, як «високий», «середній» та «низький», поєднати наслідок та ймовірність і оцінити рівень ризику, який випливає з цього, відповідно до якісних критеріїв.
Напівкількісні методи передбачають застосування числових шкал оцінювання наслідків і ймовірностей та їх поєднання, щоб отримати рівень ризику за деякою формулою. Шкали можуть бути лінійними чи логарифмічними, або можуть мати якийсь інший взаємозв’язок; використовувані формули також мо¬жуть різнитися.
Під час кількісного аналізування оцінюють практичне значення наслідків і їхніх імовірностей, а також обчислюють значення рівня ризику в конкретних одиницях, визначених під час установлювання ото¬чення. Повне кількісне аналізування не завжди може бути можливе чи слушне через недостатність інформації про аналізовувані систему чи діяльність, нестачу даних, вплив людських чинників тощо або тому, що витрати на кількісне аналізування не окупні чи потрібні. За таких обставин ефективним може бути порівняльне напівкількісне чи якісне ранжування ризиків із залученням спеціалістів, визнаних у відповідних галузях.
У разі кількісного аналізування треба чітко пояснити всі використовувані терміни та протоколювати основу для всіх критеріїв.
Навіть якщо проведено повне кількісне аналізування, потрібно визнавати, що обчислені рівні ризику є лише його оцінками. Треба бути уважним для забезпечення впевненості в тому, що їм не приписано рівень точності та прецизійності, несумісний з точністю використовуваних даних і методів аналізування.
Рівні ризику треба подавати в термінах, найпридатніших для цього типу ризику, та у формі, що сприяє оцінюванню ризику. У деяких випадках величину ризику може бути подано як розподілення ймо¬вірності за діапазоном наслідків.</p>
      </v-card-text>
      <v-card-subtitle>
        Оцінювання засобів контролювання
      </v-card-subtitle>
      <v-card-text>
        <p>Рівень ризику залежить від адекватності та результативності наявних засобів контролювання. Щоб з’ясувати це, треба відповісти на такі запитання:</p>
        <ul>
          <li>— які засоби контролювання, пов’язані з конкретним ризиком, наявні?</li>
          <li>— чи уможливлюють ці засоби контролювання адекватне обробляння ризику так, щоб підтримувати його на допустимому рівні?</li>
          <li> — чи функціюють на практиці засоби контролювання так, як передбачено, і чи можна, за потреби, продемонструвати їхню результативність?</li>
      </ul>
      <p>Упевнено відповісти на ці запитання можна тільки за наявності належної документації та запровадження відповідних процесів забезпечення.
      Рівень результативності конкретного засобу контролювання чи низки відповідних засобів контролювання може бути подано якісно, напівкількісно чи кількісно. У багатьох випадках високий рівень точності не є виправданим. Однак може бути корисно подавати та протоколювати міру результативності контролю ризику так, щоб можна було скласти думку про те, на що доцільніше спрямовувати зусил¬ля: на поліпшення засобу контролювання чи на забезпечення іншого обробляння ризику.
      </p>
      </v-card-text>
      <v-card-subtitle>
        Аналізування наслідків
      </v-card-subtitle>
      <v-card-text>
        <p>Аналізування наслідків дає змогу визначати характер і тип впливу, який може виникати, за припущення, що відбуваються конкретні події чи настають конкретні обставини. Подія може чинити низку впливів різної величини та позначатися на низці різних цілей і різних зацікавлених сторін. Типи наслідків, які треба аналізувати, і зацікавлені сторони, на яких вони позначаються, визначають під час установ¬лення оточення.
Аналізування наслідків може змінюватися від простого описування результатів до докладного кількісного моделювання чи аналізування вразливості.
Наслідок впливів може бути незначний, але з великою ймовірністю, або він може бути значний, але з малою ймовірністю, або може бути якийсь проміжний випадок. У деяких випадках доцільно робити на¬голос на ризиках з потенційно дуже змінюваними рівнями, оскільки часто саме вони є предметом особ¬ливої уваги з боку керівництва. В інших випадках може бути важливим аналізувати ризики зі значними та незначними наслідками окремо. Наприклад, часта (або постійна), але з незначним впливом проблема може мати значні сумарні чи довготривалі ефекти. Крім того, дії з обробляння, застосовувані до цих двох різних видів ризиків, часто суттєво різняться, отже, їх доцільно аналізувати окремо.
Аналізування наслідків може охоплювати</p>
        <ul>
          <li>— розгляд наявних засобів контролювання для інтерпретації наслідків разом зі всіма відповідними спричинювальними чинниками, що позначаються на наслідках;</li>
          <li>— зіставлення наслідків ризику і початкових цілей;</li>
          <li>— розгляд як безпосередніх наслідків, так і тих, що можуть виникати в подальшому, якщо це узгоджується зі сферою загального оцінювання;</li>
          <li>— розгляд вторинних наслідків, наприклад тих, що впливають на відповідно пов’язані системи, види діяльності, усталювання чи організації.</li>
        </ul>
    </v-card-text>
    <v-card-subtitle>
      Аналізування правдоподібності та кількісне оцінювання ймовірності
    </v-card-subtitle>
    <v-card-text>
      <p>Для кількісного оцінювання ймовірності зазвичай застосовують три загальні підходи, які можна використовувати окремо чи спільно:</p>
      <ul>
        <li> а) використання відповідних хронологічних даних, щоб ідентифікувати події чи ситуації, які виникали у минулому, і завдяки цьому мати змогу екстраполювати ймовірність їх виникнення в майбутньому. Треба, щоб використовувані дані відповідали розглядуваному типу системи, устатковання, організації чи діяльності, а також стандартам функціювання цієї організації. Якщо так склалося, що часто¬ та виникнення дуже низька, тоді будь-яка оцінка ймовірності буде дуже невизначеною. Це особливо стосується випадків, коли подія, ситуація чи обставина ніколи не виникали та ніхто не може припус¬тити, що вони не виникнуть у майбутньому;</li>
        <li>b) прогнозування ймовірності з використанням прогнозних методів, наприклад, аналізування дерева відмов і аналізування дерева подій (див. додаток В). Якщо хронологічних даних немає чи вони неадекватні, то ймовірність необхідно визначити, аналізуючи систему, діяльність, устатковання чи організацію, а також пов’язані з ними відмови чи справні стани. Числові дані стосовно устатковання, персоналу, організацій і систем, отримані з практичного досвіду чи опублікованих джерел даних, потім об’єднують, щоб отримати оцінку ймовірності кінцевої події. Використовуючи прогнозні методи, важливо забезпечити, щоб під час аналізування було належним чином ураховано можливість виникнення загальної відмови за одночасної відмови кількох різних частин або складників системи, зумовлених однією причиною. Для визначання ймовірності відмов устатковання чи конструкції внаслідок старіння чи інших процесів погіршання можуть бути потрібні методи імітаційного моделювання, базовані на обчислюванні впливів невизначеностей;</li>
        <li>c) для кількісного оцінювання ймовірності під час регулярного та структурованого процесу мож¬на використовувати експертні висновки. Експертні судження мають ґрунтуватись на всій наявній відповідній інформації, охоплюючи хронологічні дані, специфічну для системи та організації інформацію, експериментальні дані та проектноконструкторську документацію тощо. Є низка формальних методів отримування експертних суджень, які допомагають формулювати доречні запитання, наприклад такі: метод Дельфі, методи парних порівнянь, ранжування за категорями та експертного оцінювання абсолютної ймовірності.</li>
      </ul>
    </v-card-text>
    <v-card-subtitle>
      Попереднє аналізування
    </v-card-subtitle>
    <v-card-text>
      <p>Ризики можна ранжувати з тим, щоб визначити найзначніші ризики або вилучити з подальшого аналізування менш значні чи мінімальні ризики. Ціль полягає в тому, щоб забезпечити зосередження ресурсів на найважливіших ризиках. Однак треба дбати про те, щоб не відкинути низькі ризики, які виникають часто і мають значний сумарний ефект.
Ранжування треба базувати на критеріях, визначених для оточення. Попереднє аналізування дає змогу вибрати одну чи кілька з таких дій:</p>
      <ul>
        <li>— прийняти рішення обробляти ризики без подальшого загального оцінювання;</li>
        <li>— відхилити незначні ризики, оброблення яких недоцільне;</li>
        <li>— вдатися до докладнішого загального оцінювання.</li>
      </ul>
      <p>Початкові припущення та результати має бути задокументовано.</p>
    </v-card-text>
    <v-card-subtitle>
      Невизначеності та чутливості
    </v-card-subtitle>
    <v-card-text>
      <p>З аналізуванням ризику часто пов'язано значні невизначеності. Розуміння невизначеностей необхідне для того, щоб належним чином інтерпретувати результати аналізування ризиків і обмінюватися інформацією про них. Аналізування невизначеностей, пов’язаних з даними, методами та моделями, використовуваними для ідентифікування й аналізування ризиків, відіграє важливу роль в їх застосу¬ванні. Аналізування невизначеності передбачає визначення відхилу або неточності результатів уна¬слідок сукупного змінення параметрів і припущень, використовуваних для визначення результатів. З аналізуванням невизначеності значною мірою пов’язане аналізування чутливості.
Аналізування чутливості передбачає визначення розміру та значення величини ризику, пов’язаних зі змінами в окремих вхідних параметрах. Його використовують, щоб ідентифікувати дані, які мають бути точними, і дані, які є менш чутливі, і, тому, менше впливають на загальну точність.
Всеохопність і точність аналізування ризику треба встановити якомога повніше. В усіх можливих випадках треба ідентифікувати джерела невизначеності та звернути увагу на невизначеності, пов’язані як з даними, так і з моделлю чи методом. Треба встановити характеристики, щодо яких аналізування вкрай важливе, а також ступінь важливості.</p>
    </v-card-text>
    </v-card>
    <v-card
    v-show="vShow.ocinuivannia"
    >
      <v-card-title>
        Оцінювання ризику
      </v-card-title>
      <v-card-text>
        <p>Оцінювання ризику передбачає порівнювання кількісно оцінених рівнів ризику з критеріями ризику, визначеними під час установлювання оточення, для того, щоб установити значення рівня й типу ризику.
  Оцінювання ризику ґрунтується на розумінні ризику, набутому під час аналізування ризику, і слугує для прийняття рішень щодо подальших дій. Етичні, правові, фінансові та інші міркування, зокре¬ма, сприйняття ризику, також є вхідними даними для прийняття рішень.
  Рішення можуть бути щодо</p>
        <ul>
          <li>— потреби в оброблянні ризику;</li>
          <li>— пріоритетів обробляння;</li>
          <li>— доцільності виконування якоїсь роботи;</li>
          <li>— вибору з низки напрямків тих, яких треба дотримувати.</li>
        </ul>
        <p>На цій стадії, коли є більше інформації про конкретні ідентифіковані ризики, потрібно знову докладнішій розглянути вибрані ще під час установлювання оточення характер рішень, що їх потрібно прий¬няти, і критерії, що їх використовуватимуть для прийняття цих рішень.
  Найпростішою структурою критеріїв ризику є один рівень, що відокремлює ризики, які потребують обробляння, від ризиків, які не потребують обробляння. Ця структура дає цікаві прості результа¬ти, але не відображає невизначеності, притаманні кількісному оцінюванню ризиків і розмежуванню ризиків на ті, які потребують обробляння, і ті, які не потребують обробляння.
  Рішення щодо необхідності та способу обробляння ризику може залежати від витрат і переваг, по¬в’язаних із взяттям на себе ризику, і від витрат і переваг, пов’язаних із запровадженням поліпшених засобів контролювання.
  Загальноприйнятий підхід полягає в розділенні ризиків на три діапазони:</p>
        <ul>
          <li> a) верхній діапазон, у якому рівень ризику розглядають як недопустимий незалежно від будь-якої вигоди внаслідок діяльності, і в якому обробляння ризику конче потрібне незалежно від витрат на нього;</li>
          <li>b) середній діапазон (або «сіра» зона), у якому враховано витрати та переваги, а можливості зба¬лансовано відповідно до потенційних наслідків;</li>
          <li>c) нижній діапазон, у якому рівень ризику розглядають як незначний або настільки малий, що жод¬них заходів з обробляння ризику не потрібно.</li>
        </ul>
        <p>Система критеріїв АІ_АНР («настільки низький, наскільки це практично доцільно»), використовувана у практиці убезпечення, реалізує цей підхід, за якого середній діапазон має рухому шкалу для низьких ризиків, що дає змогу безпосередньо порівнювати витрати та переваги, тоді як для високих ризиків потенційну можливість шкоди треба знижувати доти, доки витрати на подальше знижування не стануть цілком диспропорційними отриманій перевазі щодо безпеки (див. рисунок В.12).</p>
      </v-card-text>
    </v-card>
    <v-card
    v-show="vShow.obroblennia"
    >
      <v-card-title>
        Оброблення ризику
      </v-card-title>
      <v-card-text>
        <p>Після завершення загального оцінювання ризику провадять обробляння ризику, яке передбачає вибирання та погоджування одного чи кількох прийнятних варіантів, що дають змогу змінити ймовірність виникнення ризиків, впливи ризиків або й те і друге, а також запровадження цих варіантів.
Після цього етапу виконують циклічне повторне загальне оцінювання нового рівня ризику задля визначення його допущеності за попередньо встановленими критеріями з тим, щоб прийняти рішення щодо потреби подальшого додаткового обробляння.</p>
      </v-card-text>
    </v-card>
    <v-card
    v-show="vShow.monitorynh"
    >
      <v-card-title>
        Моніторинг і критичне аналізування
      </v-card-title>
      <v-card-text>
        <p>Як частину процесу керування ризиком треба регулярно здійснювати моніторинг і критичне аналізування ризиків і засобів контролювання для перевірення того, що</p>
        <ul>
          <li> — припущення щодо ризиків й надалі чинні;</li>
          <li>— припущення, на яких базується загальне оцінювання ризику (зокрема, зовнішнє та внутрішнє оточення) й надалі чинні;</li>
          <li>— очікуваних результатів досягають;</li>
          <li>— результати загального оцінювання ризику узгоджуються з наявним досвідом;</li>
          <li>— методики загального оцінювання ризику належно застосовують;</li>
          <li>— заходи щодо обробляння ризиків є результативні.</li>
        </ul>
        <p>Треба встановити відповідальність за здійснення моніторингу та критичного аналізування.</p>
      </v-card-text>
    </v-card>
  </div>
</template>

<script>

/*disable no-console*/
export default {
  name: 'Dodatok',
  data(){
    return{
      vShow : {
        obminiuvannia: false,
        vstanovlennia: false,
        zagalneOciniuvannia: false,
        identufikuvannia: false,
        analizuvannia: false,
        ocinuivannia: false,
        obroblennia: false,
        monitorynh: false
      }
    }
  },
  methods: {
    showInfo: function(toShow){
      for(let iterator in this.vShow){
        if(iterator != toShow){
          this.vShow[iterator] = false;
        }else{
          this.vShow[iterator] = true;
        }
      }
    }
  },
  props: {

  }
}
</script>

<style scoped>
  .main {
    display: flex;
    justify-content: space-between ;
    align-items: center;

  }

  .subDiv{
    display: flex;
    justify-content: center;
    align-items: center;
    flex-direction: column;
  }

  .medium{
    height: 200px;
    justify-content: center;
    line-height: 150px; 
  }

  .small{
    width: 300px;
  }

  ul li{
    list-style: none;
  }

  .v-alert{
    cursor: pointer;
  }
</style>